In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('cfb_wk9.csv')

In [3]:
df

,Rk,Wk,Winner,Pts,Unnamed: 4,Loser,Pts.1,Notes
0,1,1,Florida Atlantic,43,NaN,Charlotte,13,NaN
1,2,1,Florida State,47,NaN,Duquesne,7,NaN
2,3,1,Illinois,38,NaN,Wyoming,6,NaN
3,4,1,Nevada,23,@,New Mexico State,12,NaN
4,5,1,Nevada-Las Vegas,52,NaN,Idaho State,21,NaN
...,...,...,...,...,...,...,...,...
495,496,9,Boise State,19,@,Air Force,14,NaN
496,497,9,Bowling Green,34,@,Central Michigan,18,NaN
497,498,9,Buffalo,34,NaN,Toledo,27,NaN
498,499,9,(21) Cincinnati,29,@,Southern Methodist,27,NaN
499,500,9,(5) Clemson,27,NaN,(14) Syracuse,21,NaN

In [4]:
df = df.drop(columns=['Rk', 'Notes'])

In [5]:
df.shape

(500, 6)

In [6]:
location = df['Unnamed: 4']

In [7]:
home = []

for index, row in df.iterrows():
    location = (row['Unnamed: 4'])
    if (location == 'N'):
        home.append(0)
    elif (location == '@'):
        home.append(row['Loser'])
    else:
        home.append(row['Winner'])

In [8]:
df['home_team'] = home

In [9]:
df = df.drop(columns=['Unnamed: 4'])

In [10]:
df

     Wk            Winner  Pts               Loser  Pts.1           home_team
0     1  Florida Atlantic   43           Charlotte     13    Florida Atlantic
1     1     Florida State   47            Duquesne      7       Florida State
2     1          Illinois   38             Wyoming      6            Illinois
3     1            Nevada   23    New Mexico State     12    New Mexico State
4     1  Nevada-Las Vegas   52         Idaho State     21    Nevada-Las Vegas
..   ..               ...  ...                 ...    ...                 ...
495   9       Boise State   19           Air Force     14           Air Force
496   9     Bowling Green   34    Central Michigan     18    Central Michigan
497   9           Buffalo   34              Toledo     27             Buffalo
498   9   (21) Cincinnati   29  Southern Methodist     27  Southern Methodist
499   9       (5) Clemson   27       (14) Syracuse     21         (5) Clemson

[500 rows x 6 columns]

In [11]:
new_df = df.copy()

In [12]:
home_results = []
for index, row in new_df.iterrows():
    if (row['home_team'] == row['Winner']):
        home_results.append(0)
    elif (row['home_team'] == row['Loser']):
        home_results.append(1)
    else:
        home_results.append(3)

In [15]:
new_df.shape

(500, 6)

In [16]:
new_df['home_results'] = home_results

In [17]:
new_df

,Wk,Winner,Pts,Loser,Pts.1,home_team,home_results
0,1,Florida Atlantic,43,Charlotte,13,Florida Atlantic,0
1,1,Florida State,47,Duquesne,7,Florida State,0
2,1,Illinois,38,Wyoming,6,Illinois,0
3,1,Nevada,23,New Mexico State,12,New Mexico State,1
4,1,Nevada-Las Vegas,52,Idaho State,21,Nevada-Las Vegas,0
...,...,...,...,...,...,...,...
495,9,Boise State,19,Air Force,14,Air Force,1
496,9,Bowling Green,34,Central Michigan,18,Central Michigan,1
497,9,Buffalo,34,Toledo,27,Buffalo,0
498,9,(21) Cincinnati,29,Southern Methodist,27,Southern Methodist,1
499,9,(5) Clemson,27,(14) Syracuse,21,(5) Clemson,0

In [18]:
wins = new_df['Winner']

In [19]:
winners = []
for i in wins:
    if (i[2] == ")"):
        winners.append(i[1:2])
        if(i[1] == "("):
            winners.append(i[1:3])
    else:
        winners.append(99)

In [20]:
len(winners)

500

In [21]:
new_df['win_rank'] = winners

In [22]:
lose = new_df['Loser']

In [23]:
losers = []
for i in lose:
    if (i[2] == ")"):
        losers.append(i[1:2])
        if(i[1] == "("):
            losers.append(i[1:3])
    else:
        losers.append(99)

In [24]:
len(losers)

500

In [25]:
new_df['lose_rank'] = losers

In [26]:
new_df = new_df.drop(columns=['Winner', 'Loser', 'home_team'])

In [27]:
new_df

     Wk  Pts  Pts.1  home_results win_rank lose_rank
0     1   43     13             0       99        99
1     1   47      7             0       99        99
2     1   38      6             0       99        99
3     1   23     12             1       99        99
4     1   52     21             0       99        99
..   ..  ...    ...           ...      ...       ...
495   9   19     14             1       99        99
496   9   34     18             1       99        99
497   9   34     27             0       99        99
498   9   29     27             1       99        99
499   9   27     21             0        5        99

[500 rows x 6 columns]

In [28]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error
from sklearn.metrics import r2_score
from sklearn.metrics import mean_absolute_error
from sklearn.metrics import mean_absolute_percentage_error

from sklearn.ensemble import AdaBoostRegressor
from sklearn.tree import DecisionTreeRegressor

In [58]:
df3 = new_df

In [59]:
df3

     Wk  Pts  Pts.1  home_results win_rank lose_rank
0     1   43     13             0       99        99
1     1   47      7             0       99        99
2     1   38      6             0       99        99
3     1   23     12             1       99        99
4     1   52     21             0       99        99
..   ..  ...    ...           ...      ...       ...
495   9   19     14             1       99        99
496   9   34     18             1       99        99
497   9   34     27             0       99        99
498   9   29     27             1       99        99
499   9   27     21             0        5        99

[500 rows x 6 columns]

In [60]:
# ut = [[10, 0, 3, 19]]
# tenn = pd.DataFrame(ut, columns=['Wk', 'home_results', 'win_rank', 'lose_rank'])
# tenn

ky = [[10, 37, 0, 3, 19]]
ken = pd.DataFrame(ky, columns=['Wk', 'Pts', 'home_results', 'win_rank', 'lose_rank'])
ken

   Wk  Pts  home_results  win_rank  lose_rank
0  10   37             0         3         19

In [61]:
y = df3['Pts.1']
X = df3.drop(columns=['Pts.1'])

X_train, X_test, y_train, y_test = train_test_split(
     X, y, test_size=0.01, random_state=2)

In [62]:
regr_1 = DecisionTreeRegressor(max_depth=4)

regr_2 = AdaBoostRegressor(
    DecisionTreeRegressor(max_depth=5), n_estimators=299, random_state=42
)

In [63]:
regr_1.fit(X_train, y_train)
regr_2.fit(X_train, y_train)

y_1 = regr_1.predict(X_train)
y_2 = regr_2.predict(X_train)

In [64]:
y_pred = regr_2.predict(ken)

In [65]:
y_pred

array([26.])

# tennessee 36.57
# kentucky 26

In [68]:
# tennessee 36.57
# kentucky 26

# 37 + 26 = 63

In [1]:
# Kentucky	+12.5 -105
# Tennessee	-12.5 -115
# over under 63.5 -110

## vw picks:
## tenn 30
## ken 16

rt picks:
tenn 45
ken 10